/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   printf_double_utils.c                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vdelsie <vdelsie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/07 20:11:19 by vdelsie           #+#    #+#             */
/*   Updated: 2019/12/07 20:28:32 by vdelsie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdlib.h>
#include <ft_printf.h>
#define UPPER(x) ((x)=='X'||(x)=='F'||(x)=='E'||(x)=='G'||(x)=='A')
#define HEX(x) ((x)=='x'||(x)=='X'||(x)=='p'||(x)=='a'||(x)=='A')
#define DABS(x) (((x) < 0.0f) ? (-x) : (x))

/*
** ft_pw ()
** Рекурсивная степенная функция.
** Мы можем сократить путь, если наша сила четна!
**
** Потому что все без знака, если мы переполнены, мы просто оборачиваемся
** (бессмысленные) результаты (я в порядке с этим ...)
*/

uintmax_t       ft_pw(uintmax_t nb, uintmax_t power)
{
    uintmax_t i;

    if (power == 0)
        return(1);
    if (power % 2 == 0)
    {
        i = ft_pw(nb)
    } 
}